import {useRouter} from 'next/router';
import {useTranslation} from 'react-i18next';

import Layout from '@/components/layout/Layout';
import {StyledService} from './StyledService';

const Service = () => {
    const {t} = useTranslation();

    const {query} = useRouter();

    return (
        <Layout title={t(`ServicesPage.${query.service}.title`)}
                description={t(`ServicesPage.${query.service}.description`)}
        >
            <StyledService>
                <div className='container'>
                    {query.service === 'search' && (
                        <div className='service-container'>
                            <h3>Наше детективне агентство пропонує послугу "Пошук", яка дозволяє знайти людину, яка
                                зникла або недоступна. Ми розуміємо, що такі ситуації можуть бути стомлюючими і
                                тривожними, тому ми готові надати вам необхідну допомогу.</h3>
                            <h3>Процес пошуку особи зазвичай включає наступні кроки:</h3>
                            <p>Збір інформації: Наші детективи спілкотимуться з вами, щоб отримати максимально повну
                               інформацію про зниклу особу. Це можуть бути особисті дані, такі як ім'я, прізвище, дата
                               народження, місце проживання, а також будь-яка інша доступна інформація, яка може
                               допомогти
                               в розшуку.</p>
                            <p>Дослідження: Наші фахівці здійснюють дослідження з використанням різноманітних джерел і
                               ресурсів. Вони можуть перевірити бази даних, звернутися до відповідних органів, залучити
                               інформаторів та використовувати інші методи, щоб знайти сліди або інформацію про
                               місцезнаходження зниклої особи.</p>
                            <p>Комунікація та зворотний зв'язок: Ми підтримуємо постійну комунікацію з вами,
                               повідомляючи
                               про прогрес у пошуку. Якщо з'являться нові відомості або сліди, ми повідомимо вас та
                               сконсультуємо щодо подальших дій.</p>
                            <p>Звітність: Після завершення пошуку ми підготуємо для вас детальний звіт, в якому будуть
                               вказані всі зібрані дані, знайдені сліди та інші відомості. Ви отримаєте об'єктивну
                               інформацію про місцезнаходження зниклої особи або результати пошуку.</p>
                            <p>Наша команда професіоналів працює виключно конфіденційно і з високим рівнем
                               професіоналізму.
                               Ми розуміємо важливість таких ситуацій і зобов'язуємося зробити все можливе, щоб
                               допомогти
                               вам знайти зниклу особу і принести полегшення у вашому житті.</p>
                            <p className='additional-text'>Будь ласка, зверніться до нас для отримання додаткової
                                                           інформації або консультації щодо
                                                           послуги "Пошук".</p>
                        </div>
                    )}
                    {query.service === 'investigation' && (
                        <div className='service-container'>
                            <h3>Наше детективне агентство надає послугу "Розслідування", яка дозволяє провести докладне
                                дослідження різних ситуацій або подій з метою з'ясування фактів і збору доказів. Ми
                                пропонуємо професійне розслідування з використанням різних методів і джерел
                                інформації.</h3>
                            <h3>Основні етапи розслідування можуть включати наступне:</h3>
                            <p>Зустріч та консультація: Наші детективи проведуть особисту зустріч або зв'язок з вами,
                               щоб отримати детальну інформацію про ситуацію, яку потрібно розслідувати. Ви можете
                               поділитися будь-якими відомостями, свідченнями, документами або іншими доказами, які ви
                               маєте.</p>
                            <p>Планування розслідування: На основі наданої інформації наша команда розробить стратегію
                               розслідування. Вона включатиме в себе визначення критеріїв успіху, виділення ресурсів,
                               встановлення послідовності дій і вибір методів розслідування, які найкраще підходять до
                               вашої конкретної ситуації.</p>
                            <p>Збір інформації: Наші детективи будуть проводити ретельне дослідження, збираючи
                               інформацію з різних джерел. Вони можуть використовувати фізичне спостереження,
                               здійснювати перевірку документів, проводити опитування свідків, аналізувати електронні
                               сліди, прослуховувати телефонні розмови (з дозволу) та використовувати інші методи для
                               отримання об'єктивних доказів.</p>
                            <p>Аналіз та інтерпретація: Зібрані дані та докази будуть піддані ретельному аналізу та
                               інтерпретації. Наші дослідники виявлять зв'язки, співставлять факти та висунуть гіпотези,
                               які допоможуть розкрити суть ситуації та знайти відповіді на поставлені питання.</p>
                            <p>Звітність: Після завершення розслідування ми підготуємо для вас детальний звіт, в якому
                               будуть представлені всі зібрані дані, факти, докази та висновки розслідування. Звіт може
                               бути супроводжений візуальними доказами, фотографіями, відеозаписами або іншими
                               матеріалами, які підкріплюють отримані результати.</p>
                            <p className='additional-text'>Ми гарантуємо конфіденційність, професіоналізм та
                                                           індивідуальний підхід до кожного розслідування. Будь ласка,
                                                           зверніться до нас для отримання додаткової інформації або
                                                           консультації щодо послуги "Розслідування".</p>
                        </div>
                    )}
                    {query.service === 'observation' && (
                        <div className='service-container'>
                            <h3>Наше детективне агентство надає послугу "Спостереження", яка дозволяє здійснювати нагляд
                                та вивчати поведінку певної особи з метою отримання об'єктивної інформації. Ми
                                пропонуємо професійне та дискретне спостереження з використанням різних методів і
                                технологій.</h3>
                            <h3>Основні етапи спостереження можуть включати наступне:</h3>
                            <p>Планування спостереження: Після отримання всієї необхідної інформації про цільову особу
                               та контекст ситуації, наша команда розробить детальний план спостереження. Він включатиме
                               в себе вибір місць, часу та методів спостереження, що найкраще відповідають вашій
                               конкретній ситуації.</p>
                            <p>Фізичне спостереження: Наші професійні детективи здійснюватимуть фізичне спостереження
                               цільової особи. Вони можуть використовувати різноманітні методи, такі як приховане
                               спостереження з використанням біноклів або технічних засобів, слідкування за цільовою
                               особою на вулицях або в приватних приміщеннях, а також фіксування фото- або
                               відеоматеріалів.</p>
                            <p>Технічне спостереження: Додатково до фізичного спостереження, ми можемо використовувати
                               різні технологічні засоби, такі як камери відеоспостереження, відеозаписи, аудіозаписи,
                               GPS-трекери та інші, для збору інформації та отримання об'єктивних доказів.</p>
                            <p>Документування та аналіз: Під час спостереження наші детективи докладно документують всі
                               спостережені факти, події, взаємодії та зміни поведінки. Ця інформація далі
                               проаналізується для висновків та підготовки звіту.</p>
                            <p>Звітність: Після завершення спостереження ми підготуємо для вас детальний звіт, який
                               включатиме всі зібрані факти, докази, фото- та відеоматеріали, а також наші висновки та
                               рекомендації. Звіт буде наданий вам в конфіденційному форматі.</p>
                            <p className='additional-text'>Будь ласка, зверніться до нас для отримання додаткової
                                                           інформації або консультації щодо послуги "Спостереження". Ми
                                                           гарантуємо професіоналізм, конфіденційність та ефективність у
                                                           виконанні наших обов'язків.</p>
                        </div>
                    )}
                    {query.service === 'adultery' && (
                        <div className='service-container'>
                            <h3>Наше детективне агентство надає послугу "Подружня зрада", спрямовану на виявлення фактів невірності або зради однієї з подружніх сторін. Ми розуміємо, що підозри щодо невірності можуть створювати невпевненість, страждання та напруження в вашому відносині. Наша команда професіоналів готова надати вам допомогу у з'ясуванні ситуації.</h3>
                            <h3>Основні етапи послуги "Подружня зрада" можуть включати наступне:</h3>
                            <p>Консультація та збір інформації: Наші детективи проведуть особисту зустріч або зв'язок з вами, щоб отримати детальну інформацію про підозрівану невірність. Ви можете поділитися будь-якими відомостями, свідченнями, доказами або підозрами, які ви маєте.</p>
                            <p>Розслідування: Наша команда використовуватиме різні методи та підходи, щоб виявити факти невірності. Це може включати фізичне спостереження, перевірку документів, аналіз електронної пошти, текстових повідомлень або соціальних мереж, а також співпрацю з приватними дослідниками для отримання додаткової інформації.</p>
                            <p>Збір доказів: Наші детективи займуться збором об'єктивних доказів, таких як фотографії, відеозаписи, аудіозаписи або інші матеріали, що підтверджують факти невірності. Ми гарантуємо використання законних методів для отримання доказів.</p>
                            <p>Аналіз та звітність: Зібрані дані та докази будуть ретельно проаналізовані нашою командою. Ми підготуємо для вас докладний звіт, в якому будуть представлені всі зібрані факти, докази та висновки щодо подружньої зради. Звіт може бути супроводжений візуальними матеріалами, які підкріплюють отримані результати.</p>
                            <p>Конфіденційність та підтримка: Ми розуміємо, що це складна та емоційно напружена ситуація. Ми гарантуємо повну конфіденційність усіх отриманих даних та інформації. Наша команда також готова надати вам підтримку та консультації, щоб допомогти вам управляти цими складними емоціями.</p>
                            <p className='additional-text'>Будь ласка, зверніться до нас для отримання додаткової інформації або консультації щодо послуги "Подружня зрада". Ми готові допомогти вам у з'ясуванні ситуації та відновленні гармонії у вашому особистому житті.</p>
                        </div>
                    )}
                </div>
            </StyledService>
        </Layout>
    );
};

export default Service;