import {useTranslation} from 'react-i18next';

import Layout from '@/components/layout/Layout';
import {StyledServices} from './StyledServices';

const Services = () => {
    const {t} = useTranslation();

    return (
        <Layout title={t('ServicesPage.title')}
                description={t('ServicesPage.description')}
        >
            <StyledServices>
                <div className='container'>
                    <h3 className='title'>Наше детективне агентство пропонує широкий спектр послуг для ваших потреб у розслідуванні різних ситуацій. <br/> Ось кілька основних послуг, які ми надаємо на нашому веб-сайті:</h3>
                    <div>
                        <h3>Пошук</h3>
                        <p>Якщо ви шукаєте людину, яка зникла або недоступна, ми можемо вам допомогти. Наші професійні детективи використовують свої навички та ресурси для встановлення контакту зі зниклою особою та надають вам звіт про її місцезнаходження.</p>
                    </div>
                    <div>
                        <h3>Розслідування</h3>
                        <p>Ми проводимо розслідування різного роду кримінальних справ або незрозумілих подій. Наші досвідчені детективи збирають докази, аналізують інформацію та надають вам звіт, який допоможе розкрити правду.</p>
                    </div>
                    <div>
                        <h3>Спостереження</h3>
                        <p>Якщо вам потрібно здійснити нагляд або вивчити поведінку певної особи, наші спеціалісти можуть забезпечити цю послугу. Вони проведуть дискретне спостереження, фіксуючи дії та діяльність особи, про яку ви хочете дізнатися більше.</p>
                    </div>
                    <div>
                        <h3>Подружня зрада</h3>
                        <p>Якщо у вас є підозри щодо невірності вашого партнера, ми можемо вам допомогти встановити факти. Наші детективи проведуть розслідування, зберуть докази та нададуть вам об'єктивний звіт щодо подружньої зради.</p>
                    </div>
                    <p className='additional-text'>Наше детективне агентство гарантує конфіденційність та професіоналізм у наданні послуг. Ми розуміємо, що кожна ситуація унікальна, тому надаємо індивідуальний підхід до кожного клієнта. Будь ласка, зверніться до нас за детальною інформацією про будь-яку з цих послуг або іншу допомогу, яку ви можете потребувати.</p>
                </div>
            </StyledServices>
        </Layout>
    );
};

export default Services;